{
  "navbar": {
    "home": "Home",
    "about": "About",
    "theme": "Change color theme"
  },
  "langauge": {
    "en": "English",
    "fr": "French"
  },
  "home": {
    "job": "Software and Information Systems Engineer",
    "resume": "Renault Group . Engineering degree in Computer Science EFREI . Double degree Sorbonne University",
    "description": "Welcome to my blog. I’m Yasmine, passionate about new technologies, always curious to learn and innovate. Below, you’ll find an overview of my personal projects. Using the widgets just above, you can check out my CV, send me an email, or call me. I’d be delighted to connect with you!",    "my-repos": "My top 5 personal applications",
    "my-cv": "My CV",
    "title": "Welcome to Yasmine's Blog",
    "some-works": "Some of my personal projects"
  },
  "repository": {
    "source-code": "Source code",
    "deployed": "Deployed",
    "trip-planner": {
      "name": "Trip Planner",
      "description": "Trip-Planner is an all-in one application for planning trips, managing your budget, receiving sightseeing suggestions, and organizing group travels. "
    },
    "teach-finder": {
      "name": "Teach Finder",
      "description": "Teach-Finder is a web application that helps schools to find the right teacher for their needs. It allows them to search for teachers based on their skills, location, and availability."
    },
    "share-kind-words": {
      "name": "Share Kind Words",
      "description": "Share Kind Words is a simple web application that allows users to read and post kind messages. It is a great way to spread positivity and kindness."
    },
    "llm-detector": {
      "name": "LLM Detector",
      "description": "LLM Detector is an application that allows users to detect whether a text was generated by a large language model or not. It is a great way to check the authenticity of a text."
    },
    "mini-native-js-projects": {
      "name": "Native modern JS Projects",
      "description": "Four mini projects developed using modern JavaScript techniques without relying on frameworks, with increasing complexity from chapter_1, where I created a mini quiz application to chapter_4, where I built a chat app featuring authentication and Firebase integration"
    }
  },
  "tooltips": {
    "source-code": "See the source code on GitHub",
    "deployed": "See the deployed website",
    "see-github": "See all in Github",
    "see": "See all"
  },
    "about": {
        "me": "About me",
        "academic": "My academic journey",
        "professional-experience": "My professional experience",
        "skills": "My skills",
        "fun-facts": "Fun facts"
    },
  "me": "Hey everyone! I’m Yasmine, passionate about new technologies, always curious to learn and innovate. I’m a software engineer with 2 years of experience at Renault and over 5 years of studies in tech. But there’s more to me than just that! What truly matters to me is helping others and spreading positivity around me. Beyond tech and volunteering, I recharge by playing volleyball. Yes, a healthy mind in a healthy body!",
  "me-end": "If you want to know more about me, keep scrolling down",
  "me-fun-facts": "Spoiler: fun facts about me await you at the end 🎉",
  "academic": "My academic journey began at {Sorbonne} University, where I pursued a {first-degree} in Computer Science and Physics. This education provided me with a strong foundation in algorithms and programming. After earning these two degrees, I decided to specialize further by joining {EFREI}, a renowned engineering school in computer science. There, I enrolled in the {second-degree} track, which allowed me to strengthen my skills in software development, system architecture, and IT project management.",
  "first-degree": "double degree",
  "second-degree": "Software and Information Systems",

  "professional-experience": "It has been almost two years since I started working at {renault}, specifically within the {ampere} entity. During the first year, I developed a Python library to optimize the management of automotive diagnostic specifications, ensure data reliability through consistency tests, and automate certain repetitive tasks. This year, I am focusing on developing Wireshark plugins to decode proprietary network protocols used in vehicles. This requires a strong understanding of network protocols and expertise in automotive connectivity.",
  "skill-1": {
    "title": "Fullstack Development",
    "description": "Proficient in multiple programming languages, I have designed numerous web applications using modern and efficient frameworks. My experience also includes Android application development and software testing engineering. I incorporate advanced software design principles, including design patterns and UML modeling, to ensure sustainable and scalable architectures."
  },
  "skill-2": {
    "title": "DevOps and Cloud",
    "description": "I am also skilled in automating development and deployment processes. I have gained solid experience in setting up CI/CD pipelines, integrating automated tests, and managing cloud environments. I am proficient with containerization tools such as Docker and Kubernetes, which allows me to optimize resource management and ensure effective application scalability."
  },
  "skill-3": {
    "title": "Systems and Networks",
    "description": "My education and experience have given me a strong understanding of information systems and networks. I have worked on projects involving server configuration, database management, and network traffic analysis. I am familiar with automotive communication protocols and security standards, enabling me to design robust and secure solutions."
  },
  "fun-facts": "When I was little, I never missed an episode of the show {emission}. I was convinced that one day, I too would have a magic board and a lab truck to explain improbable things. It fueled my curiosity for science and technology. The result: 15 years later, still no truck, but a PC, code everywhere, and servers running in a corner. In the end, it’s kind of the same… without Jamy’s checkered shirts."

}

