{
  "navbar": {
    "home": "Home",
    "about": "About me"
  },
  "langauge": {
    "en": "English",
    "fr": "French"
  },
  "home": {
        "job": "Software and Information Systems Engineer",
        "description": "This is a place where I share my thoughts and ideas. xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "my-repos": "My top 5 personal applications",
        "my-cv": "My CV",
        "title": "Welcome to Yasmine's Blog "

  },
    "repository": {
        "source-code": "Source code",
        "deployed": "Deployed",
        "trip-planner": {
          "name": "Trip Planner",
          "description": "Trip-Planner is an all-in one application for planning trips, managing your budget, receiving sightseeing suggestions, and organizing group travels. "
        },
        "teach-finder": {
          "name": "Teach Finder",
          "description": "Teach-Finder is a web application that helps schools to find the right teacher for their needs. It allows them to search for teachers based on their skills, location, and availability."
        },
        "share-kind-words": {
          "name": "Share Kind Words",
          "description": "Share Kind Words is a simple web application that allows users to read and post kind messages. It is a great way to spread positivity and kindness."
        },
        "llm-detector": {
          "name": "LLM Detector",
          "description": "LLM Detector is an application that allows users to detect whether a text was generated by a large language model or not. It is a great way to check the authenticity of a text."
        },
        "mini-native-js-projects": {
          "name": "Native modern JS Projects",
          "description": "Four mini projects developed using modern JavaScript techniques without relying on frameworks, with increasing complexity from chapter_1, where I created a mini quiz application to chapter_4, where I built a chat app featuring authentication and Firebase integration"

        }

    },
    "tooltips": {
        "source-code": "See the source code on GitHub",
        "deployed": "See the deployed website",
        "see-github": "See all in Github",
      "see": "See all"
    }
}